Kevin-l-wu/STM32_STDLIB/Test/ADC/BspAdcCont.c

#include "stm32_eval.h"
#include "stm32_eval_spi_flash.h"

#include "LogDebug.h"
#include "platform_config.h"
#include <stdio.h>

#include "BspUtility.h"
#include "BspAdcCont.h"



#define CHANNEL_NUM 6

uint16_t* gAdcConvertResult[CHANNEL_NUM] = {0}; 

extern void MainDelay(unsigned int n);


void BspAdcCont(void)
{ 	
	ADC_InitTypeDef ADC_InitStructure; 
	GPIO_InitTypeDef GPIO_InitStructure;

	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA | RCC_APB2Periph_ADC1, ENABLE );	  //使能ADC1通道时钟
 
	RCC_ADCCLKConfig(RCC_PCLK2_Div6);   //设置ADC分频因子6 72M/6=12,ADC最大时间不能超过14M

	//PA1 作为模拟通道输入引脚                         
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3 | GPIO_Pin_4 | GPIO_Pin_5;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;		//模拟输入引脚
	
	GPIO_Init(GPIOA, &GPIO_InitStructure);	

	ADC_DeInit(ADC1);  //复位ADC1,将外设 ADC1 的全部寄存器重设为缺省值

	ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;	//ADC工作模式:ADC1和ADC2工作在独立模式
	ADC_InitStructure.ADC_ScanConvMode = DISABLE;	//模数转换工作在单通道模式
	ADC_InitStructure.ADC_ContinuousConvMode = ENABLE;	//模数转换工作在单次转换模式
	ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;	//转换由软件而不是外部触发启动
	ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;	//ADC数据右对齐
	ADC_InitStructure.ADC_NbrOfChannel = CHANNEL_NUM;	//顺序进行规则转换的ADC通道的数目
	
	ADC_Init(ADC1, &ADC_InitStructure);	//根据ADC_InitStruct中指定的参数初始化外设ADCx的寄存器   


	ADC_TempSensorVrefintCmd(ENABLE);
	
	
//	ADC_DiscModeCmd(ADC1, ENABLE);
	
	
//	ADC_DiscModeChannelCountConfig(ADC1, 6);
  
	ADC_Cmd(ADC1, ENABLE);	//使能指定的ADC1
	
	ADC_ResetCalibration(ADC1);	//使能复位校准  
	 
	while(ADC_GetResetCalibrationStatus(ADC1));	//等待复位校准结束
	
	ADC_StartCalibration(ADC1);	 //开启AD校准
 
	while(ADC_GetCalibrationStatus(ADC1));	 //等待校准结束
	
	
	ADC_RegularChannelConfig(ADC1, ADC_Channel_0, 1, ADC_SampleTime_239Cycles5 );	//ADC1, ADC通道,采样时间为239.5周期	 
	ADC_RegularChannelConfig(ADC1, ADC_Channel_1, 2, ADC_SampleTime_239Cycles5 );
	ADC_RegularChannelConfig(ADC1, ADC_Channel_2, 3, ADC_SampleTime_239Cycles5 );
	
	ADC_RegularChannelConfig(ADC1, ADC_Channel_3, 4, ADC_SampleTime_239Cycles5 );
	ADC_RegularChannelConfig(ADC1, ADC_Channel_4, 5, ADC_SampleTime_239Cycles5 );
	ADC_RegularChannelConfig(ADC1, ADC_Channel_5, 6, ADC_SampleTime_239Cycles5 );
	
	
	
	
	ADC_SoftwareStartConvCmd(ADC1, ENABLE);
	
 
//	ADC_SoftwareStartConvCmd(ADC1, ENABLE);

}				  

void BspGetAdcValCont(u16* pResult)   
{
	//ADC_RegularChannelConfig(ADC1, ch, 1, ADC_SampleTime_239Cycles5 );	//ADC1, ADC通道,采样时间为239.5周期	  			    
  
	//ADC_SoftwareStartConvCmd(ADC1, ENABLE);		//使能指定的ADC1的软件转换启动功能	
	
	unsigned int index = 0;
	
	if(pResult != NULL)
	{
		for(index = 0; index < CHANNEL_NUM; index++)
		{
			
			while(!ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC ));

			*(pResult + index) = ADC_GetConversionValue(ADC1);	//返回最近一次ADC1规则组的转换结果
		}
	}
}

/*
u16 BspGetAdcAverageVal(u8 ch, u8 times)
{
	u32 temp_val = 0;
	u8 t;
	
	for(t = 0; t < times; t++)
	{
		temp_val += BspGetAdcVal(ch);
		MainDelay(80);
	}
	
	return (temp_val / times);
}
*/
